Import pandas<br>
Getting started and checking your pandas setup<br>
Difficulty: esay<br>
1. Import pandas under the alas pd.

In [1]:
import pandas as pd

2.Print the version of pandas that has been imported

In [2]:
pd.__version__

'1.5.0'

3. Print out all the version information of the libraries that are required by the pandas library

In [ ]:
pd.show_versions()

4. Create a DataFrame df from this dictionary data which has the index labels.

In [7]:
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

5. Display a summary of the basic information about this DataFrame and its data(hint: there is a single method that can be called on the DataFrame).

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

6.  Return the first 3 rows of the DataFrame df.

In [9]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

7.  Select just the 'animal' and 'age' columns from the DataFrame df.

In [12]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

8. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [17]:
df[['animal', 'age']].iloc[[3, 4, 8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

9. Select only the rows where the number of visits is greater than 3.

In [23]:
df[df['visits'] >= 3]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

10. Select the rows where the age is missing, i.e. it is NaN.

In [25]:
df[df.age.isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

11. Select the rows where the animal is a cat and the age is less than 3.

In [29]:
df[(df.animal == 'cat') & (df.age < 3) ]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

12. Select the rows the age is between 2 and 4 (inclusive).

In [30]:
df[(df.age<4)&(df.age>2)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

13. Change the age in row 'f' to 1.5.

In [32]:
df.loc['f', 'age'] = 1.5
df.head(10)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

14. Calculate the sum of all visits in df (i.e. find the total number of visits).

In [34]:
df.visits.sum()

19

In [41]:
df.sum()['visits']

19


15. Calculate the mean age for each different animal in df.

In [39]:
df.groupby('animal').mean()

C:\Users\Admin\AppData\Local\Temp\ipykernel_2336\267308092.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('animal').mean()

             age  visits
animal
cat     2.333333     2.0
dog     5.000000     2.0
snake   2.500000     1.5

In [40]:
df.groupby('animal')['age'].agg('mean')

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

16. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [42]:
df.loc['k'] = ['monkey', 2, 3, 'yes']
df.drop(index=['k'], inplace=True)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

17. Count the number of each type of animal in df.

In [43]:
df['count'] = 1
df.groupby('animal')['count'].agg('sum')

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

In [44]:
df['count'] = 1
df.groupby('animal')['count'].sum()

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

In [45]:
df.groupby('animal').count()

        age  visits  priority  count
animal
cat       3       4         4      4
dog       3       4         4      4
snake     2       2         2      2

18. Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).

In [48]:
df.sort_values(by=['age', 'visits'], ascending=[0, 1])

  animal  age  visits priority  count
i    dog  7.0       2       no      1
e    dog  5.0       2       no      1
g  snake  4.5       1       no      1
j    dog  3.0       1       no      1
b    cat  3.0       3      yes      1
a    cat  2.5       1      yes      1
f    cat  1.5       3       no      1
c  snake  0.5       2       no      1
h    cat  NaN       1      yes      1
d    dog  NaN       3      yes      1

19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [49]:
df = df.replace({'yes':True, 'no': False})

In [50]:
df

  animal  age  visits  priority  count
a    cat  2.5       1      True      1
b    cat  3.0       3      True      1
c  snake  0.5       2     False      1
d    dog  NaN       3      True      1
e    dog  5.0       2     False      1
f    cat  1.5       3     False      1
g  snake  4.5       1     False      1
h    cat  NaN       1      True      1
i    dog  7.0       2     False      1
j    dog  3.0       1     False      1

20. In the 'animal' column, change the 'snake' entries to 'python'.

In [51]:
df['animal'].replace({'snake':'python'}, inplace=True)
df

   animal  age  visits  priority  count
a     cat  2.5       1      True      1
b     cat  3.0       3      True      1
c  python  0.5       2     False      1
d     dog  NaN       3      True      1
e     dog  5.0       2     False      1
f     cat  1.5       3     False      1
g  python  4.5       1     False      1
h     cat  NaN       1      True      1
i     dog  7.0       2     False      1
j     dog  3.0       1     False      1

21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).